In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [4]:
obj = pd.Series([4, 7, 3, 9, 6])

In [5]:
obj

0    4
1    7
2    3
3    9
4    6
dtype: int64

In [6]:
obj.values

array([4, 7, 3, 9, 6], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
obj2 = pd.Series([4, 9, 10, 2, 1], index=['a', 'b', 'c', 'd', 'e'])

In [12]:
obj2[obj2 > 5]

b     9
c    10
dtype: int64

In [13]:
data = {'physics' : {'Author': 'Okeke', 'Qty': 25, 'year' : 2002, 'prize' : 5000},
        'chemistry': {'Author': 'Ababio', 'Qty': 50, 'year' : 2000, 'prize' : 10000},
        'government': {'Author': 'Henry', 'Qty': 20, 'year' : 2005, 'prize' : 6700},
        'economics': {'Author': 'Humphrey', 'Qty': 10, 'year' : 2000, 'prize' : 7000}
       }

In [14]:
Emperor = pd.DataFrame(data)

In [16]:
Emperor

       physics chemistry government economics
Author   Okeke    Ababio      Henry  Humphrey
Qty         25        50         20        10
year      2002      2000       2005      2000
prize     5000     10000       6700      7000

In [17]:
Emperor.T

              Author Qty  year  prize
physics        Okeke  25  2002   5000
chemistry     Ababio  50  2000  10000
government     Henry  20  2005   6700
economics   Humphrey  10  2000   7000

In [23]:
Emperor.values

array([['Okeke', 'Ababio', 'Henry', 'Humphrey'],
       [25, 50, 20, 10],
       [2002, 2000, 2005, 2000],
       [5000, 10000, 6700, 7000]], dtype=object)

In [24]:
Emperor.min

<bound method NDFrame._add_numeric_operations.<locals>.min of        physics chemistry government economics
Author   Okeke    Ababio      Henry  Humphrey
Qty         25        50         20        10
year      2002      2000       2005      2000
prize     5000     10000       6700      7000>

In [25]:
Emperor.max

<bound method NDFrame._add_numeric_operations.<locals>.max of        physics chemistry government economics
Author   Okeke    Ababio      Henry  Humphrey
Qty         25        50         20        10
year      2002      2000       2005      2000
prize     5000     10000       6700      7000>

In [3]:
titanic_data = pd.read_csv('titanic.csv')

In [4]:
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
titanic_data